import React, { useEffect, useState } from "react";
import { Config } from "../../config/helper";
import { request } from "../../config/request";
import { Card, Typography, Divider, Row, Col, message, Spin ,Image} from 'antd';
import "./HistoryPageView.css";

const containerStyle = {
  padding: '20px',
  margin: '0 auto',
  maxWidth: '1200px',
  backgroundColor: 'white',
  marginTop: '-25px',
};

const cardStyle = {
  width: "100%",
  marginBottom: '20px',
  borderRadius: '8px',
  overflow: 'hidden',
};

const imgStyle = {
  width: "100%",
  height: 'auto',
};

const textContainerStyle = {
  padding: '20px',
  fontFamily: 'KhmerOSSiemReap',

};

const titleStyle = {
  textAlign: 'center',
  marginBottom: '20px',
  fontFamily: 'KhmerOSSiemReap',
  color:'#343293'
};

const paragraphStyle = {
  textAlign: 'justify',
  textJustify: 'inter-word',
  fontFamily: 'KhmerOSSiemReap',
  color:'#343293'

};

const { Paragraph, Title } = Typography;

const HistoryPageView = () => {
  const [list, setList] = useState([]);
  const [loading, setLoading] = useState(false);

  useEffect(() => {
    getList();
  }, []);

  const getList = async () => {
    setLoading(true);
    try {
      const res = await request("history/getList", "get");
      if (res && res.list && res.list.length > 0) {
        const lastItem = res.list[res.list.length - 1];
        setList([lastItem]);
      }
    } catch (error) {
      message.error("Failed to fetch the list");
    } finally {
      setLoading(false);
    }
  };

  return (
    <div style={containerStyle}>
      {loading ? (
        <div style={{ textAlign: 'center', padding: '50px' }}>
          <Spin size="large" />
        </div>
      ) : (
        list.map((item, index) => (
          <div key={index}>
            <br></br>
            {/* <Title level={2} style={titleStyle}>{item.title}</Title> */}
            <Card hoverable style={cardStyle}>
            <h2 style={{ color:'#343293'}}>ប្រវត្តិមន្ទីរពេទ្យជាតិ តេជោសន្តិភាព</h2>
            <p style={{ color:'#343293'}}>
            មន្ទីរពេទ្យជាតិ តេជោសន្ដិភាព ត្រូវបានសាងសង់ឡើងដោយបានមកពីបទពិសោធន៍ដ៏ឈឺចាប់កាលពីឆ្នាំ២០២០ និង២០២១ ដែលពេលនោះកម្ពុជាពុំទាន់មានទីកន្លែងគ្រប់គ្រាន់ក្នុងការទទួលព្យាបាលអ្នកជំងឺកូវីដ-១៩ រាប់ម៉ឺននាក់។ មន្ទីរពេទ្យនេះបានចាប់ផ្តើមសាងសង់ឡើងនៅថ្ងៃទី១៤ ខែកុម្ភៈ ឆ្នាំ២០២២ ក្រោមការដឹកនាំដ៏ឈ្លាសវៃ, ប៉ិនប្រសប់, ម៉ឺងម៉ាត់ និង ប្រាកដនិយមរបស់ សម្តេចអគ្គមហាសេនាបតីតេជោ ហ៊ុន សែន ជាអតីតនាយករដ្ឋមន្ដ្រី និងជាប្រធានព្រឹទ្ធសភា នៃព្រះរាជាណាចក្រកម្ពុជា ដោយបានចង្អុលបង្ហាញជូនឯកឧត្តម ឃួង ស្រេង អភិបាលរាជធានីភ្នំពេញ និងជាប្រធានគណៈបញ្ជាការឯកភាពរាជធានី សហការជាមួយឯកឧត្ដមសាស្រ្តាចារ្យ ម៉ម ប៊ុនហេង អតីតរដ្ឋមន្ត្រីក្រសួងសុខាភិបាល ដើម្បីរកទីតាំងសាងសង់អគារសម្រាប់ដាក់អ្នកជំងឺកូវីដ-១៩ ដែលស្ថានការពេលនោះគឺមានអត្រាឆ្លងខ្ពស់ និងចំនួនអ្នកស្លាប់ក៏មានការកើនឡើង។ 
            </p>
             <img
                className="responsive-image"
                src="https://files.tsnh.gov.kh/image-1735550967129-670064111"
                alt="Hospital Image 1"
              />
            <p style={{ color:'#343293'}}>
            ក្រោយពីទទួលបាននូវការចង្អុលចង្ហាញដ៏ខ្ពង់ខ្ពស់បំផុត ឯកឧត្តម ឃួង ស្រេង អភិបាល នៃគណៈអភិបាលរាជធានីភ្នំពេញ បានដឹកនាំកសាង និងរកទីកន្លែង ដែលសម្របសម្រួលសម្រាប់សាងសង់មន្ទីរពេទ្យដ៏ធំមួយនេះ។ 
            បន្ទាប់ពីរកបានទីតាំង ឯកឧត្តម ឃួង ស្រេង និងសហការីបន្ដគិតរកក្រុមហ៊ុនមកសាងសង់ឱ្យបានឆាប់រហ័សធ្វើយ៉ាងណាស្រូតឱ្យហើយក្នុងរយៈពេល ១២ខែ សម្រាប់ដាក់អ្នកជំងឺ ដើម្បីទ្រទ្រង់សភាពការណ៍នាពេលនោះ។
              
              </p>
           
              <Row gutter={[16, 16]} align="middle">
                <Col xs={24} md={12}>
                 <p style={{ color:'#343293'}}>

                 ក្រៅពីការផ្ដល់ទីតាំង និងរកក្រុមហ៊ុនសាងសង់ លោកអភិបាល សុំការណែនាំផ្នែកបច្ចេកទេសពីក្រសួងសុខាភិបាល ដែលដឹកនាំដោយលោកជំទាវវេជ្ជបណ្ឌិត យក់ សម្បត្តិ រដ្ឋលេខាធិការក្រសួងសុខាភិបាល តំណាងឱ្យឯកឧត្តមសាស្ដ្រាចារ្យ ម៉ម ប៊ុនហេង អតីតរដ្ឋមន្ដ្រីក្រសួងសុខាភិបាលដើម្បីពិនិត្យបច្ចេកទេសសាងសង់ផ្នែកសុខាភិបាល។ លោកជំទាវបានសហការយ៉ាងស្រស្រាក់ស្រស្រាំដុតដៃដុតជើងជាមួយ ឯកឧត្តម ឃួង ស្រេង ផ្នែកបច្ចេកទេស ក្នុងការរៀបចំមន្ទីរពេទ្យនេះ ធ្វើយ៉ាងណាឱ្យមន្ទីរពេទ្យនេះក្លាយជាមន្ទីរពេទ្យអាចផ្ទុកជំងឺទៅតាមបច្ចេកទេសវេជ្ជសាស្ដ្រ សម័យទំនើបដូចបណ្ដាលមន្ទីរពេទ្យផ្សេងទៀតនៅប្រទេសជឿនលឿន។ លោកជំទាវតែងតែពិភាក្សាជាប់ជានិច្ច ក្រុមការងាររបស់ក្រសួងសុខាភិបាល ដើម្បីដោះស្រាយបញ្ហាប្រឈមចំពោះមុខ ដូចសម្ភារៈបរិក្ខារពេទ្យដែលត្រូវយកមកបំពាក់។ ក្រៅពីការរៀបចំបច្ចេកទេសសាងសង់ និងបច្ចេកទេសសុខាភិបាល មានក្រសួងសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ដែលដឹកនាំដោយ ឯកឧត្តមអគ្គបណ្ឌិតសភាចារ្យ អូន ព័ន្ធមុនីរ័ត្ន ឧបនាយករដ្ឋមន្ត្រី និងជារដ្ឋមន្ទ្រីក្រសួងសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ បានសម្របសម្រួលក្នុងការបញ្ចេញទឹកប្រាក់ ដើម្បីឱ្យមន្ទីរពេទ្យនេះលេចរូបរាងឡើងបានយ៉ាងឆាប់រហ័សស្ថិតនៅទីតាំងតាមបណ្តោយមហាវិថីឈ្នះឈ្នះ សង្កាត់គោករកា ខណ្ឌព្រែកព្នៅ រាជធានីភ្នំពេញ ដែលមានក្រឡាផ្ទៃសាងសង់ ៧៥,៨០០ ម៉ែត្រក្រឡា ដែលអាចមានសមត្ថភាពទទួលអ្នកជំងឺបាន ៩,៤៩៦ គ្រែ។
                 </p>
                </Col>
                <Col xs={24} md={12}>
                <Image
                 width={570}
                 height={340}
                   
              src="https://files.tsnh.gov.kh/image-1735620380718-682834055"
            />
                </Col>
              </Row>
           
            <p style={{ color:'#343293'}}>
            អគាររបស់មន្ទីរពេទ្យមាន សរុបចំនួន១១ អគារ ក្នុងនោះរួមមាន៖ អគាររដ្ឋបាល និងផ្គត់ផ្គង់ ឬអគារA អគារស្នាក់នៅសម្រាប់បុគ្គលិក អគារសម្រាកព្យាបាល និងសង្គ្រោះបន្ទាន់ដែលក្នុងនោះមានអគារ E, អគារH1ដល់អគារH7 និងអគារបច្ចេកទេសT1និងT2។ ក្រោយពីប្រទេសកម្ពុជាសម្រេចបាននូវភាពជោគជ័យក្នុងការចាក់វ៉ាក់សាំងកូវីដ-១៩ទៅដល់ប្រជាពលរដ្ឋទូទាំងប្រទេសដោយទទួលបានលទ្ធផលល្អប្រសើរ និងបានបើកដំណើរការប្រទេសពេញលេញឡើងវិញ លើគ្រប់វិស័យ និងការរស់នៅជាមួយកូវីដ-១៩ តាមបែបគន្លងថ្មី ព្រមទាំងការប្រយុទ្ធទប់ស្កាត់ការឆ្លងជំងឺចូលក្នុងសហគមន៍ របស់រាជរដ្ឋាភិបាលទទួលបានជោគជ័យ។ ក្នុងឱកាសនោះផងដែរ សម្តេចអគ្គមហាសេនាបតីតេជោ ហ៊ុន សែន ប្រធានព្រឹទ្ធសភា នៃព្រះរាជាណាចក្រកម្ពុជា និងជាអតីតនាយករដ្ឋមន្ដ្រី បានអញ្ជើញពិនិត្យមើលវឌ្ឍនភាពនៃការសាងសង់មន្ទីរពេទ្យ នៅថ្ងៃទី១៩ ខែមករា ឆ្នាំ២០២៣ សម្តេចតេជោ បានកែប្រែគោលដៅដើមនៃមន្ទីរពេទ្យនេះសម្រាប់គ្រប់គ្រងជំងឺឆ្លង ទៅជាមន្ទីរពេទ្យពហុព្យាបាល ក្នុងគោលបំណងដើម្បីកាត់បន្ថយអត្រាចាល់អ្នកជំងឺនៅមន្ទីរពេទ្យនានាក្នុងរាជធានីភ្នំពេញ។ មន្ទីរពេទ្យជាតិ តេជោសន្ដិភាព ជាគ្រឹះស្ថានសាធារណរដ្ឋបាល ដោយអនុក្រឹត្យលេខ៦១ អនក្រ.បក ចុះថ្ងៃទី០៧ ខែមីនា ឆ្នាំ២០២៣ និងបានបើកប្រជុំក្រុមប្រឹក្សាភិបាល លើកទី១ ថ្ងៃទី០១ ខែកុម្ភៈ ឆ្នាំ២០២៣ ដឹកនាំដោយលោកជំទាវ យក់ សម្បត្តិ ប្រធានក្រុមប្រឹក្សាភិបាល លោកជំទាវបានឱ្យមន្ទីរពេទ្យបង្កើតគណៈកម្មការមន្ទីរពេទ្យ ដើម្បីដឹកនាំមន្ដ្រីរាជការ និងបុគ្គលិក និងជំរុញឱ្យលោកនាយកមន្ទីរពេទ្យបង្កើតរចនាសម្ព័ន្ធពីនាយផ្នែករហូតដល់នាយសាល ដើម្បីត្រៀមបើកដំណើរការសាកល្បងនាថ្ងៃទី០១ ខែកញ្ញា ឆ្នាំ២០២៣។ បន្ទាប់ពីដាក់សាកល្បងដំណើរការមន្ទីរពេទ្យឱ្យប្រើប្រាស់មួយខែកន្លងមក ឯកឧត្តមសាស្ដ្រាចារ្យ ឈាង រ៉ា រដ្ឋមន្ដ្រីក្រសួងសុខាភិបាល បានដឹកនាំក្នុងការចុះត្រួតពិនិត្យដំណើរការបើកសាកល្បងមន្ទីរពេទ្យនាថ្ងៃទី០២ ខែតុលា ឆ្នាំ២០២៣ ដើម្បីរៀបចំដាក់សម្ពោធឱ្យប្រើប្រាស់ជាផ្លូវការនៅថ្ងៃទី២៤ ខែតុលា ឆ្នាំ២០២៣ ក្រោមអធិបតីភាពដ៏ខ្ពង់ខ្ពស់បំផុត សម្តេចមហាបវរធិបតី ហ៊ុន ម៉ាណែត នាយករដ្ឋមន្ត្រីនៃព្រះរាជាណាចក្រកម្ពុជា និងលោកជំទាវបណ្ឌិត ពេជ ចន្ទមុន្នី ហ៊ុន ម៉ាណែត រហូតការសម្ពោធទទួលបានជោគជ័យយ៉ាងត្រចេះត្រចង់។
            </p>
            <img
                className="responsive-image"
               src="https://files.tsnh.gov.kh/image-1735550980349-168654340"
                alt="Hospital Image 2"
              />
            <p style={{ color:'#343293'}}>

            បច្ចុប្បន្នមន្ទីរពេទ្យបានដាក់ដំណើរការគ្រែចំនួនសរុប៧៥០គ្រែ មានចំនួន១៣ផ្នែក រួមមានផ្នែកពិគ្រោះជំងឺក្រៅ និងពិនិត្យសុខភាព, ផ្នែកសង្រ្គោះបន្ទាន់, ផ្នែកវេជ្ជសាស្រ្តទូទៅ និងជំងឺឆ្លង, ផ្នែកប្រពោធនកម្មវេជ្ជសាស្រ្ត, ផ្នែកសល្យសាស្ត្រ, ផ្នែករោគកុមារ និងទារកសាស្រ្ត, ផ្នែកសម្ភព និងរោគស្រ្តី, ផ្នែកប្រពោធនកម្មសល្យសាស្រ្ត, ផ្នែកសណ្ដំ, ផ្នែកមន្ទីរពិសោធន៍, ផ្នែករូបភាពវេជ្ជសាស្ត្រ, ផ្នែកឱសថ និងផ្នែករថយន្តសង្រ្គោះបន្ទាន់។ ដោយគិតត្រឹមឆ្នាំ២០២៤ មន្ទីរពេទ្យមានបុគ្គលិកសរុប៧៣២នាក់ ដែលក្នុងនោះមានបុគ្គលិកសុខាភិបាលចំនួន៥៣៦នាក់ និងបុគ្គលិកមិនមែនសុខាភិបាលចំនួន១៩៦នាក់ សម្រាប់ប្រតិបត្តិការការងារប្រចាំថ្ងៃប្រកបដោយនិយ័តកម្ម។ ដើម្បីអនុវត្តស្របតាមកម្មវិធីនយោបាយអាទិភាពរបស់រាជរដ្ឋាភិបាល នីតិកាលទី៧ នៃរដ្ឋសភា និងយុទ្ធសាស្ត្របញ្ចកោណ ដំណាក់កាលទី១ ការផ្តល់ការថែទាំសុខភាពឆ្ពោះទៅកម្មវិធីគ្របដណ្តប់សុខភាពជាសកល ការផ្តល់សេវាថែទាំសុខភាពជូនគ្រួសារងាយរងហានិភ័យ ការពង្រីកការថែទាំសុខភាពរបស់របបសន្តិសុខសង្គម ឬហៅកាត់ថា ប.ស.ស. និងមូលនិធិសមធម៌ មន្ទីរពេទ្យបានខិតខំប្រឹងប្រែង យកចិត្តទុកដាក់ ក្នុងការព្យាបាល និងបម្រើប្រជាពលរដ្ឋដោយមិនរើសអើងឡើយ ។
            </p>

          <img
                className="responsive-image"
                 src="https://files.tsnh.gov.kh/image-1735620368022-377875245"
                alt="Hospital Image 3"
              />

          <h2 style={{ color:'#343293'}}>វិឌីអូអំពីមន្ទីរពេទ្យ</h2>
            {/* <br/> */}
            <div>
            <iframe src="https://www.facebook.com/plugins/video.php?href=https://www.facebook.com/tsnhhospital/videos/2971852606279321&mute=0&show_text=0&width=560&height=315"   
                width={"100%"}
                height={537}
                maxWidth={1100}
                scrolling="no" 
                frameborder="0" 
                allowfullscreen="true" 
                allow="autoplay; clipboard-write; encrypted-media; picture-in-picture; web-share">
              </iframe>

            </div>
           

            </Card>
          
          </div>
        ))
      )}
    </div>
  );
};

export default HistoryPageView;
